[
    {
        "source": "https://newsinfo.inquirer.net/1411623/sc-confirms-another-justice-to-retire-for-health-reasons",
        "date": "4:34 PM March 26, 2021",
        "title": "SC confirms another justice to retire for health reasons",
        "article_body": "\nMANILA, Philippines—Supreme Court Associate Justice Edgardo Delos Santos is considering retiring early due to health reasons, Public Information Chief and Spokesperson Atty. Brian Keith Hosaka said Friday.\n“According to Justice Delos Santos, due to health reasons, he is considering the possibility of retiring ahead of his 70th birthday on 12 June 2022,” Hosaka told reporters.\nHosaka said the magistrate had sent a letter to his staff advising them as early as March 19, 2021, to look for other employment, “knowing the difficulty of finding a job during this pandemic.”\n“Justice Delos Santos further added that he remains an incumbent member of the Supreme Court until after a specific date of retirement, as may be indicated in a formal letter from him to the En Banc, is accepted and acted upon by the Court,” Hosaka added.\nSince last year, Delos Santos is the third magistrate to opt for early retirement and the second to cite health reasons.\nIn November last year, the high court has accepted the early retirement of Associate Justice Priscilla Baltazar-Padilla. She was supposed to retire in 2028. The high court did not provide details on her reason for early retiring except that she applied for “disability retirement.”\nOn the other hand, Chief Justice Diosdado Peralta has also opted for early retirement. Today is his last day as Chief Justice, as his retirement is on March 27. He was supposed to hang his robe on March 27, 2022. He gave no reason for his decision to retire early.\nTo date, President Rodrigo Duterte has appointed 16 magistrates—three have already retired while two retired early—Padilla and now Ombudsman Samuel Martires.\nDuterte has also appointed three chief justices—Lucas Bersamin, Teresita Leonardo De Castro, and Peralta.\nThe Judicial and Bar Council has already submitted to the President the names of a possible replacement for Peralta and the fourth chief justice appointed by the President.",
        "author": "Tetch Torres-Tupas"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411718/phs-covid-19-cases-top-700000-as-doh-reports-about-10000-new-infections",
        "date": "4:24 PM March 26, 2021",
        "title": "PH’s COVID-19 cases top 700,000 as DOH reports about 10,000 new infections",
        "article_body": "\nMANILA, Philippines — The Philippines’ COVID-19 cases propelled to 702,856 on Friday as health authorities reported a fresh daily-high of 9,838 infections.\nData from the Department of Health (DOH) also showed that nationwide active cases are now at their highest 109,018 since the first case of the new coronavirus disease was detected in the Philippines in January last year.\nMeanwhile, 663 more COVID-positive patients have recovered, raising the tally to 580,689, while fatalities rose to 13,149 with the death of 54.\nAccording to DOH, the latest number of active cases take 15.5 percent of the total COVID-19 caseload in the country while the tally of recovered patients and fatalities are now at 82.6 percent and 1.87 percent, respectively.\nIt also said that 98.1 percent of active cases were asymptomatic patients and those with mild symptoms.\nDOH further noted that 29 duplicate entries, including 14 recovered patients, and a case that was later found to have tested negative from SARS-CoV-2, the new coronavirus that causes COVID-19, were removed from the total case count.\nLikewise, DOH said 22 cases that were previously tagged as recovered patients were reclassified as deaths after final validation.\nSeven laboratories were not able to submit data to the COVID-19 Document Repository System on Thursday, it added.\nAlso on Friday, DOH explained that the positivity rate for 32,069 individuals who were tested for COVID-19 is at 17.3 percent. Positivity rate refers to the percentage of people who test positive out of the total number of persons who have been tested for the new coronavirus.\nCase bulletin dated March 1 showed that the positivity rate for 14,142 people who have been tested for the virus is at 7.5 percent, equivalent to 1,063 individuals. In the February 1 bulletin, 4.4 percent or 1,046 of the 23,521 who were tested have yielded positive results for SARS-CoV-2. And on January 1, 7.2 percent or 769 of the 10,710 people who were tested were detected to have the virus.\nIn the wake of the rapid surge in COVID-19 cases, the government recently placed Metro Manila, Cavite, Bulacan, Rizal, and Laguna under general community quarantine and called it the “NCR Plus bubble” from March 22 to April 4 in a bid to curb the spread of the virus.",
        "author": "Cathrine Gonzales"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411705/thailand-faces-meth-trafficking-surge-after-myanmar-coup",
        "date": "4:22 PM March 26, 2021",
        "title": "Thailand faces meth trafficking surge after Myanmar coup",
        "article_body": "\nNONG KHAI, Thailand — A village watchman trains his binoculars on a suspicious fishing boat — the first line of defense as Thailand braces for a fresh methamphetamine influx after a coup in neighboring Myanmar.\nThe kingdom’s narcotics bureau has already seized more than 80 million “yaba” pills just in the past six months, a record haul partly blamed on a supply glut caused by the coronavirus pandemic.\nBut now the United Nations warns of an even bigger deluge as Myanmar’s legal economy tanks, following weeks of nationwide unrest and strike action following the military takeover.\n“If past actions are an indicator of what’s coming, then we’re likely to see another increase in synthetic drug production,” said Jeremy Douglas of the UN Office on Drugs and Crime.\nHe told AFP that organized crime groups and allied militias across the border were likely working to strengthen their positions while Myanmar was in turmoil.\n“The best way to make big money fast is the drug trade, and the pieces are in place to scale up,” Douglas said.\nSynthetic drug production is already the number one revenue source for several insurgent groups and militias in lawless pockets of Myanmar close to the borders of Thailand and Laos.\nThe frontier traversing the three countries makes up the “Golden Triangle” that has for decades been the hub of Southeast Asia’s lucrative drug trade.\nThe recent supply glut has kept the street value of a meth pill in Bangkok at rock bottom prices — 50 baht ($1.66) apiece.\nMethamphetamine’s more potent crystallized form normally gets sent on to wealthier overseas markets such as Australia and Japan, although pandemic transport bottlenecks have disrupted that trade.\nHeavier patrols along the Myanmar border have not deterred traffickers, with Thai authorities estimating that around three-quarters of illegal drugs entering their territory are now routed through Laos.\nThe battle against the meth trade between the two countries, divided by the Mekong River, is hampered by a lack of manpower and equipment such as night-vision gear, motion sensors and motorbikes.\nThe provincial naval unit in charge of monitoring the border has also been forced to increase land patrols because drought and Chinese-funded dams upstream have caused water levels to drop.\nAuthorities have in recent months begun using dedicated village volunteer groups living along the river to provide around-the-clock surveillance of the border.\nTheir local knowledge is helping spot drug-runners trying to blend in with ordinary fishermen on the Mekong.\n“We always spot the boats with the fake fishermen,” said Rachin Sinpho, 58, who heads up a volunteer group at a village in Nong Khai province.\n“They won’t come to the riverbank. If there are many fishermen out… they won’t go close to them and will stay away.”\nDragonflies buzz overhead as Rachin points out a shed on the Laos side of the Mekong river that is reported to be storing a ton of yaba tablets.\nHe says his team is busiest in the first hours before dark and the last before dawn. Drug traffickers time their movements with changeovers in the local police force’s shifts.\nThe volunteers do not make arrests because they are unarmed and some drug smugglers have guns.\nBut they do tip off police to the movements of traffickers, as was the case during the last big arrest at a neighbouring village.\n“The drug-runners carried the packages from their boats and hid the drugs in the grass and trees on the riverbank,” Rachin said.\n“They sent a car to the spot to collect the drugs. Just as the car was leaving, the police came and arrested them and found five million yaba tablets.”\nDuangphaisri Ninket, who runs an accommodation business in the village, said she feels safer knowing Rachin’s team are keeping watch.\nBut the 54-year-old still worries about meth taking hold in her community.\n“I’m afraid if they start selling drugs in my village it will affect the youth. They will become addicts,” she told AFP.",
        "author": ""
    },
    {
        "source": "https://newsinfo.inquirer.net/1411707/covid-19-hits-over-15000-health-workers-doh",
        "date": "4:15 PM March 26, 2021",
        "title": "COVID-19 hits over 15,000 health workers — DOH",
        "article_body": "\nMANILA, Philippines — A total of 15,662 healthcare workers have been afflicted with COVID-19 since the new coronavirus reached the Philippine shores in 2020, the Department of Health (DOH) said Friday.\nData from the DOH showed that of this number, some 533 health workers still have active cases, while 15,047 have recovered. On the other hand, 82 of them have died.\nThe health department said the total tally represents 2.26 percent of the total 693,048 COVID-19 cases in the country as of Thursday.\nAccording to DOH, more health workers have been infected with the new coronavirus in  as the country faced fresh surge of infections.\nHealth Undersecretary Maria Rosario Vergeire said the number of healthcare workers who had COVID-19 began to decrease in November last year until the new cases started to increase again this March.\n“Ngayon pong Marso, nag-increase na po siya ulit (But in March, it increased again). From 474 infections in February, we now have a total of 684 from March 1 to March 25,” she said in an online press briefing.\nVergeire said the increase of confirmed cases among  is expected with the recent surge of infections following the detection of more transmissible SARS-CoV-2 variants.\nShe again appealed to the public to follow the priority list for vaccination given these figures.\n“Kaya nga po inuulit natin, ibigay muna natin ang mga bakuna sa ating (That’s why we are appealing to give the vaccines first to) healthcare workers because they are the ones primarily affected and the ones most exposed among all of us here in the population,” said Vergeire.\nThe country has so far recorded a total of 693,048 COVID-19 cases as of Thursday. Of the total, 99,891 are active cases, 580,062 are recoveries, and 13,095 are deaths.\nAs of March 23, the country has administered 508,332 doses of COVID-19 vaccines as first shots from the 1,525,600 donated doses of Sinovac and AstraZeneca vaccines.",
        "author": "Cathrine Gonzales"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411686/bureau-of-immigration-warns-public-against-online-scammers",
        "date": "3:59 PM March 26, 2021",
        "title": "Bureau of Immigration warns public against online scammers",
        "article_body": "\nMANILA, Philippines — The Bureau of Immigration (BI) on Friday told the public to be wary of scammers posing as immigration employees on Facebook.\nBI Commissioner Jaime Morente issued the warning after an Indian student filed a complaint about a supposed lawyer posing as an immigration hearing officer.\n“We conducted an investigation and saw that there were many similar complaints in the past about this fake lawyer that introduced herself as a certain Atty. Lisa Perez Tubban,” Morente said in a statement.\n“She presented herself as a fixer than can process the application of these students,” he added.\nAccording to BI, there were no records of such a person employed in the agency.\n“We suspect she’s using a fake name, as she used the photo of one of our contractual employees as her profile picture,” Morente said.\nBI said that current rules authorize only school representatives to process applications on behalf of foreign students in the country.\nBut the Indian student had a disagreement with her school, leading her to turn to Facebook for help.\n“The fake employee offered to process her application but requested pre-payment sent through online fund transfer,” Morente said.\nThe complaint stated that the victim paid a total of P45,000 in several tranches before the suspect stopped replying to her.\n“These are all scams. Immediately report to the authorities if you encounter any such attempts,” Morente said.\nEarlier, BI posted a warning against fake immigration officers promising to escort travelers at the airport and fake employees involved in a love scam.\nThe case of the Indian student will be referred to the National Bureau of Investigation Anti-Cybercrime Group for investigation, Morente said.\n\n\n",
        "author": ""
    },
    {
        "source": "https://newsinfo.inquirer.net/1411690/ched-six-heis-partner-with-lgus-to-serve-as-vaccination-centers",
        "date": "3:38 PM March 26, 2021",
        "title": "CHED: Six HEIs partner with LGUs to serve as vaccination centers",
        "article_body": "\nMANILA, Philippines — Six higher education institutions (HEIs) have agreed to become vaccination centers at local government units (LGUs) where they are located, the Commission on Higher Education (CHED) said Friday.\nCHED chairman Prospero De Vera III said in a statement Friday that the following HEIs have retrofitted their facilities to help in the government’s COVID-19 vaccination program:\n1. University of Santo Tomas Hospital (NCR)\n2. Manila Central University Gymnasium (NCR)\n3. St. Louis University Baguio Gymnasium (CAR)\n4. De La Salle Medical Health Sciences Institute (Region 4)\n5. Our Lady of Fatima University (NCR)\n6. Central Philippine University (CPU)\nAccording to De Vera, more HEIs might soon agree to turn facilities into vaccination centers as he encouraged them to extend help “as the country gears for expanded vaccination of senior citizens, essential workers, teachers, and government personnel starting the 2nd quarter of the year.”\n“In return, we ask the LGUs to include the HEI faculty, staff, and students who are assisting in the vaccination drive in their vaccination list so they can assist their LGUs,” De Vera added.\nWith more vaccines expected to arrive in the country, De Vera said “we must maximize the use of large alternative venues to be readily available so that the priority groups (essential workers, seniors, the indigents) could be inoculated without further delay.”\nA set of guidelines for establishing vaccination centers in HEIs is already being prepared by CHED and its group of public health experts.\nDe Vera said the guidelines will also be discussed with LGUs and the Inter-Agency Task Force for the Management of Emerging Infectious Disease.",
        "author": "Krissy Aguilar"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411680/solon-seeks-instant-sanctions-for-govt-execs-who-skipped-vaccine-priority-list",
        "date": "3:31 PM March 26, 2021",
        "title": "Solon seeks ‘instant sanctions’ for gov’t execs who skipped vaccine priority list",
        "article_body": "\nMANILA, Philippines — Show cause orders for local officials who jumped the line in the vaccine priority list are no longer enough, and “instant sanctions” should be meted on them to set an example to would be-violators, Quezon City Rep. Precious Hipolito Castelo said Friday.\nCastelo said it is only by imposing penalties swiftly on violators and responsible officials that the government could send the message that it is serious in enforcing pandemic response measures impartially.\n“Show cause orders and citations of law or rules are not enough. We should have instant sanctions for vaccine queue jumpers and those with command responsibility for violations to set the example for all concerned and the general public,” Castelo said in a statement.\n“As it is, there is the perception that only the small fry like localized lockdown breakers are caught and penalized instantly, while pasaways in high places get away with infractions,” the lawmaker added.\nCastelo said it is “unbelievable” that those who skip the priority list can think they can get away with getting vaccinated as “substitutes” for healthcare workers who were absent or who refused the jabs.\n“That’s just an alibi. There are many doctors, nurses, other medical practitioners, and hospital personnel who are willing to take the vaccine to protect themselves from the virus and continue attending to patients,” she said.\nThe Department of Interior and Local Government (DILG) earlier issued  to five mayors for getting vaccinated against COVID-19 ahead of the prioritized sector.\nFollowing the issuance of such orders on the five mayors,  may also be asked to explain why they got their COVID-19 shots ahead of those in the priority list, DILG Undersecretary Epimaco Densing III said Friday. —",
        "author": ""
    },
    {
        "source": "https://newsinfo.inquirer.net/1411696/zambales-mayor-tests-positive-for-covid-19",
        "date": "3:28 PM March 26, 2021",
        "title": "Zambales mayor tests  positive for COVID-19",
        "article_body": "\nSAN ANTONIO, Zambales –– Mayor Jun Rundstedt Ebdane of Iba, the capital town of Zambales, announced on Friday that he was tested positive for coronavirus disease (COVID-19).\nIn a Facebook post, Ebdane said he had been in isolation since March 21 after learning that he had close contact with a COVID-19 patient.\nHe said the result of his rapid antigen test on March 21 showed that he was nonreactive, but his reverse transcription-polymerase chain test result four days later was positive for COVID-19.\nBefore learning about his health status, the mayor said the risk of him transmitting the virus was low since he wore a face mask and shield while attending public events.\nOn March 22, the mayor’s father, Gov. Hermogenes Ebdane Jr., also announced that he had tested positive for COVID-19 after a series of public engagements. INQ\nLZB",
        "author": "Joanna Rose Aglibot"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411643/thailand-urges-calm-after-death-of-covid-19-vaccine-recipient",
        "date": "3:18 PM March 26, 2021",
        "title": "Thailand urges calm after death of COVID-19 vaccine recipient",
        "article_body": "\nBANGKOK Thai health officials rushed to calm public fears on Friday after confirming a man had died 10 days after receiving a COVID-19 vaccine earlier this month.\nThe cause of death was from an abdominal aortic aneurysm (AAA) and rupture, senior health official Sopon Mekton said, adding the country’s vaccination campaign would continue.\nThe man was inoculated on March 3 and died on March 13.\n“I am confident this death is from the aneurysm and not related to the vaccine,” Sopon told a news conference.\nAn AAA is the swelling of the main blood vessel that leads from the heart and ruptures can be fatal.\nThe man, whose age was not disclosed, had a pre-existing health condition and had undergone surgery in January, said health official Tawee Chotpitayasunond, describing it as “a time bomb in the body.”\nHealth Minster Anutin Charnvirakul urged the public to take vaccines.\nSo far, Thailand has administered about 136,000 doses of coronavirus vaccines, mostly using those of China’s Sinovac Biotech but AstraZeneca vaccines have also been given.\nPrime Minister Prayuth Chan-ocha was the first in Thailand to receive an AstraZeneca shot on March 16, which was delayed by several days after reports in Europe of blood clots among some recipients.\nThose inoculated in Thailand so far have been frontline medical workers or groups seen as at risk due to potential exposure to the virus, or their age and pre-existing health conditions.\nThailand has reported 28,577 coronavirus infections and 92 fatalities.",
        "author": ""
    },
    {
        "source": "https://newsinfo.inquirer.net/1411677/covid-19-icu-occupancy-rate-nearing-moderate-risk-treatment-czar",
        "date": "3:14 PM March 26, 2021",
        "title": "COVID-19 ICU occupancy rate nearing moderate risk — treatment czar",
        "article_body": "\nMANILA, Philippines — The occupancy rate for COVID-19 dedicated intensive care units (ICU) is already nearing the moderate risk as the country battles a fresh surge of infections, treatment czar Health Undersecretary Leopoldo Vega said Friday.\nIn an online press briefing, Vega also noted that the overall healthcare utilization for COVID-19 patients is at low-risk 41-percent.\n“Sa healthcare utilization across the country, we still have a low risk but this is already at 41 percent pero ang nangyayari po sa report po natin, ‘yung ICU utilization across the country po ay tumaas na, nearing the threshold of moderate risk,” he said.\n(On healthcare utilization across the country, we are still at low risk but it is already at 41 percent. Our report shows that the ICU utilization in the country has increased and is nearing the threshold of moderate risk.)\nData from the COVID-19 tracker of the Department of Health (DOH) showed that 54.34 percent of ICU beds for COVID-19 patients are already occupied. Meanwhile, occupancy for isolation beds is at 42.86 percent and 40.76 percent for ward beds.\nThe DOH classifies occupancy rate at the safe level if it is less than 60 percent, moderate risk at 60 to less than 70 percent, high risk at 70 to less than 85 percent, and critical at more than 85 percent.\nAccording to Vega, the utilization rate for COVID-19 ward and isolation beds is increasing in Metro Manila and is at “high-moderate” risk.\nHe said that the admission rate for COVID-19 ward beds is increasing particularly in Makati, Quezon City, Taguig, and Manila since mild cases are being admitted in hospitals in these areas.\nVega earlier said during a televised briefing that the temporary treatment and monitoring facilities in Metro Manila are already 78-percent occupied.\nWith the increase of COVID-19 cases, Vega said the government is set to inaugurate two modular hospitals in Quezon City and Batangas this coming April.\nHe said the DOH in coordination with the Department of Public Works and Highways (DPWH) has initiated efforts to build modular hospitals since last year as part of preparations for a possible surge in cases.\nOne of these modular hospitals to open next month is located at the Quezon Institute, according to Vega.\n“Natapos na po ito. This is a 110-bed facility. Hospital po ito, para po sa moderate and severe. Magiging functional ‘yan after the Holy Week, April 8,” he said.\n(This has been finished. This is a 110-bed facility. This is a hospital for moderate and severe cases. It will be functional after the Holy Week, on April 8.)\nVega said the modular hospital will be operated and managed by the Jose Reyes Memorial Medical Center.\nAccording to Vega, another 44-bed modular hospital will also be operational in front of the Batangas Medical Center before the third week of April.\nHe added that a modular facility was likewise inaugurated at the Dr. Jose N. Rodriguez Memorial (Tala) Hospital in Caloocan City last week but it still needs a staff to be operational.\nVega said that the DOH and the DPWH are proposing the creation of more modular hospitals, especially at the Lung Center of the Philippines since it has a large space.\nThe country has so far recorded a total of 693,048 COVID-19 cases since the pandemic reached Philippine shores in 2020. Of the total, 99,891 are active cases, 580,062 are recoveries, and 13,095 are deaths.\n\n\n",
        "author": "Cathrine Gonzales"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411670/duque-to-recommend-elevating-ofws-spot-in-covid-19-vaccine-priority-list",
        "date": "3:11 PM March 26, 2021",
        "title": "Duque wants OFWs to be elevated to top of COVID vax priority list",
        "article_body": "\nMANILA, Philippines — Health Secretary Francisco Duque III said on Friday that he would recommend to the Inter-Agency Task Force for the Management of Emerging Infectious Diseases (IATF) that overseas Filipino workers (OFWs) be elevated to the top of the government’s COVID-19 vaccination priority list.\n“Ako po mismo ang mangangatawan sa Inter-Agency Task Force na iangat po ang estado dito po sa ating prioritization framework,” Duque told lawmakers during a House of Representatives overseas workers affairs committee hearing.\n(I will ask the Inter-Agency Task Force to raise their status in the prioritization framework.)\nCurrently, OFWs are classified as B5 in the prioritization list. If approved, they will move up six spots or A4.\nA4, according to the list, are those classified as “frontline personnel in essential sectors including uniformed personnel and those in working sectors identified by the IATF as essential during enhanced community quarantine.)”\nThe health chief added that he would also propose that OFWs who are health workers be included in the A1 spot, OFWs who are senior citizens may be classified as A2, and the OFWs who have comorbidities may be classified as A3.\n“The rest, ipapasok po natin sa A4. ‘Yun po ang aming napagkasunduan kanina at malugod ko pong pangangatawan ito sa IATF sa susunod naming pagpupulong,” Duque told lawmakers.\n(The rest, we will include it as A4. That is what we have agreed on and I will relay this in the next IATF meeting.)\nAsked by lawmakers when can they have an update on it, Duque said that they can expect the latest by Tuesday.\n“By Monday I think we will be able to do this sa meeting of the Inter-Agency Task Force. Bago pa ‘yun, kakausapin ko po ang iba pang kalihim na ito po ay suportahan at makakapagbigay po kami ng kasagutan siguro baka mga Martes po,” he said.\n(Before that, I will talk this to the other secretaries and give you an answer by Tuesday.)\nabc",
        "author": "Katrina Hallare"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411666/ched-allows-24-colleges-universities-to-hold-limited-in-person-classes",
        "date": "2:59 PM March 26, 2021",
        "title": "CHED allows 24 colleges, universities to hold limited in-person classes",
        "article_body": "\nMANILA, Philippines — The Commission on Higher Education (CHED) has allowed 23 colleges and universities to conduct limited face-to-face classes starting the second semester of School Year 2020-2021.\nCHED said in a statement Friday that selected allied health-related degree programs such as Medicine, Nursing, Medical Technology or Medical Laboratory Science, Physical Therapy, Midwifery, and Public Health were prioritized to conduct limited face-to-face classes.\nIt also said that this move will enable students to achieve key learning outcomes on specialized laboratory courses and hospital-based clinical clerkship, and provide additional manpower to the country’s health system as the country faces a pandemic.\nColleges and universities allowed to resume limited in-person classes are the following:\nThe above-mentioned higher education institutions (HEIs) already complied with the “stringent retrofitting and health standards” imposed by CHED along with the Department of Health (DOH), and the Inter-Agency Task Force for the Management of Emerging Infectious Diseases, according to chairperson Prospero De Vera III.\n“These HEIs have fully complied with the CHED-DOH guidelines and have been inspected by CHED and their LGUs so they can now bring their 3rd and 4th year students for hands-on training and laboratory classes in a limited face-to-face system,” the CHED chief said.",
        "author": "Krissy Aguilar"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411659/taiwan-us-to-strengthen-maritime-coordination-after-china-law",
        "date": "2:54 PM March 26, 2021",
        "title": "Taiwan, US to strengthen maritime coordination after China law",
        "article_body": "\nTAIPEI — Taiwan and the United States have signed their first agreement under the Biden administration, establishing a Coast Guard Working Group to coordinate policy, following China’s passing of a law that allows its coast guard to fire on foreign vessels.\nThe new government of U.S. President Joe Biden has moved to reassure Chinese-claimed Taiwan that its commitment to the island is rock solid.\nThe defacto Taiwanese ambassador to the United States, Hsiao Bi-khim, signed the agreement in Washington on Thursday, her office said in a statement.\n“It is our hope that with the new Coast Guard Working Group, both sides will forge a stronger partnership and jointly contribute even more to a free and open Indo-Pacific region.”\nU.S. Acting Assistant Secretary of State for East Asian and Pacific Affairs Sung Kim was at the signing ceremony, the office said.\nThe American Institute in Taiwan, which handles U.S. ties with the island, said the United States supported “Taiwan’s meaningful participation and contributions to issues of global concern, including in maritime security and safety”.\nTaiwan is upgrading its coast guard with new ships, which can be drafted into naval service in the event of war, as the island deals with increasing encroachments from Chinese fishing boats and sand dredgers in Taiwan-controlled waters.\nWhile the United States, like most countries, has no formal diplomatic ties with Taiwan, it is the island’s most important international backer and arms supplier.\nChina passed a law in January that for the first time explicitly allows its coast guard to fire on foreign vessels, causing concern regionally and in Washington. China has rebuffed those worries.\nTaiwan Premier Su Tseng-chang said on Friday China’s new law had shocked the region and that those with “common values” needed to work together to protect peace.\n“This unilateral request for the coast guard to use force will cause great tension and pressure on neighboring countries,” he told reporters.\nChina also has maritime sovereignty disputes with Japan in the East China Sea and with several Southeast Asian countries in the South China Sea.",
        "author": ""
    },
    {
        "source": "https://newsinfo.inquirer.net/1411656/allow-local-health-execs-to-give-next-priority-group-unused-vaccines-villanueva",
        "date": "2:37 PM March 26, 2021",
        "title": "Allow local health execs to give next priority group unused vaccines — Villanueva",
        "article_body": "\nMANILA, Philippines — Senator Joel Villanueva urged the national government Friday to allow local health officials to reallocate unused vaccines on the next priority groups instead of returning them back to Metro Manila.\nCiting the archipelagic nature of the country, Villanueva said allowing local health officials to reallocate leftover vaccines will prevent spoilage.\n“The DOH ground commanders can be authorized to give them to the next priority groups,” Villanueva said in a statement.\n“Marami tayong isla. Hindi naman tayo isang landmass na pwedeng isakay mo kaagad sa trak. Kung ikakarga ulit sa eroplano, ang laki ng gastos at abala,” the senator added.\n(We have a lot of islands. We not in one landmass that you can just transport them in trucks. If we have to transport them through planes, that’s a lot of expenses.)\nVillanueva likewise said local health officials should be trusted to make the “snap adjustments” for as long as these comply with the vaccination priority list that gives no room for “line jumpers.”\n“Huwag na po natin hayaan mag-round trip ang bakuna.  After all, it will not be earning any mileage points,” Villanueva said. (We should not allow our vaccines to go on a round-trip. It will not earn any mileage points.)\n“Nariyan po ang ating mga seniors, lalo na po yung ating mga essential workers sa ganung age group,” he added. (We have our senior citizens and essential workers who are in that age group.)\nMore than half of the COVID-19 vaccines from British-Swede drugmaker AstraZeneca that were allocated to  were not used by health workers as the vaccination drive in the region ended on Tuesday, an official of the Department of Health (DOH) earlier said.\nDr. Mary Jean Loreche, the DOH regional spokesperson, said the unused vaccines can be redistributed to other subgroups on the priority list, such as senior citizens and other frontliners in the region.\nHowever, the DOH earlier said it will recall any excess vaccines after the deadline given to healthcare facilities to utilize the COVID-19 vaccines and redistribute these to areas with high cases of the disease.\n“That may look good on paper but there are geographical realities and transportation restrictions. Pero aminin po natin na (We have to admit that) we don’t have the flexibility to make that instant diversion,” Villanueva said.\n“Ang end result pa rin naman po ay (The end result is still) by vaccinating other key groups in the community, we are increasing their common defense against the virus. We are preventing outbreaks,” he added.",
        "author": "Neil Arwin Mercado"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411654/missile-test-propels-north-korea-to-top-of-bidens-foreign-agenda",
        "date": "2:36 PM March 26, 2021",
        "title": "Missile test propels North Korea to top of Biden’s foreign agenda",
        "article_body": "\nSEOUL/WASHINGTON North Korea’s claim on Friday that it had launched a new type of tactical short-range ballistic missile highlighted military advances by the nuclear-armed state and propelled it to the top of new U.S. President Joe Biden’s foreign policy agenda.\nThe United States condemned Thursday’s launches, which came hours before Biden held his first White House press conference since taking office in January.\nWhen asked if he agreed that North Korea was the top foreign policy issue he faced, Biden replied: “Yes.”\nBiden had previously left North Korea entirely out of his maiden foreign policy speech in February, and in outlining eight diplomatic priorities earlier in March, his secretary of state didn’t focus on North Korea except to list it as one of several countries that pose a challenge.\nThe launches, which were North Korea’s first ballistic missile tests in nearly a year, underscored steady progress in its weapons program since denuclearisation talks with the United States floundered under former President Donald Trump.\nBiden said the United States remained open to diplomacy with North Korea despite its missile tests, but warned there would be responses if Pyongyang escalates matters.\nSouth Korea’s President Moon Jae-in called the missile test “concerning,” saying Seoul, Pyongyang, and Washington should not create hurdles for talks.\n“Now is the time for the South, the North, and the United States to make efforts to continue dialogue. It is never desirable to create difficulties for dialogue,” he told a ceremony commemorating soldiers who fought in clashes with the North in 2002 and 2010.\nNorth Korea had been widely expected to conduct some kind of weapons test in the early months of Biden’s term as a way of signaling its resolve, gaining practical military capabilities, and boosting its leverage should talks resume.\nWhile North Korea’s intentions were not yet entirely clear, Thursday’s tests were relatively restrained, said John Delury, a professor at South Korea’s Yonsei University.\n“These tests come some time after Biden’s inauguration, and they are still at a low enough level that it gives the administration breathing room,” he said. “Regardless of North Korea’s intentions, however, the effect is to elevate the significance and move it up the administration’s agenda.”\nThe State Department said the launches violated multiple U.N. Security Council resolutions and threatened the region and the broader international community.\nThe new weapon is based on existing technology that was improved to carry a 2.5-ton warhead, KCNA reported.\n“The development of this weapon system is of great significance in bolstering up the military power of the country and deterring all sorts of military threats,” said Ri Pyong Chol, the senior leader who oversaw the test, according to KCNA.\nPhotos released by state media showed a black-and-white painted missile blasting off from a military launch vehicle.\nMissile specialists at the California-based James Martin Center for Nonproliferation Studies (CNS) said it appeared to be a missile that was unveiled at a major military parade in Pyongyang in October.\nKCNA said Thursday’s test confirmed the missile’s capability to conduct “low-altitude gliding leap type flight mode,” a feature that makes such weapons harder to detect and shoot down.\nThe United Nations Security Council North Korea sanctions committee is due to meet on Friday to discuss the missile tests, at the request of the United States.\nThe move suggests a measured response by the Biden administration, as the sanctions committee is comprised of lower-level diplomats from the 15 council members, rather than the ambassador-level council that convened after North Korea fired ballistic missiles a year ago.\nWhile rejecting American overtures, North Korea has also used measured language, insisting it will only return to talks if the United States drops hostile policies.\nAnalysts noted leader Kim Jong Un did not appear to attend the Thursday missile tests, with state media instead showing undated photos of him inspecting new passenger busses in Pyongyang.\nKim has vowed to try to improve living conditions for citizens as North Korea’s economy was ravaged by multiple crises, including international sanctions over its weapons programs, natural disasters, and a border lockdown that slowed trade to a trickle in an effort to prevent a coronavirus outbreak.",
        "author": ""
    },
    {
        "source": "https://newsinfo.inquirer.net/1411652/new-zealands-catholic-church-apologizes-to-survivors-of-abuse",
        "date": "2:26 PM March 26, 2021",
        "title": "New Zealand’s Catholic Church apologizes to survivors of abuse",
        "article_body": "\nWELLINGTON — New Zealand’s Catholic Church formally apologized on Friday to the survivors of abuse within the church and said its systems and culture must change.\nCardinal John Dew, who is the Roman Catholic Archbishop of Wellington and Metropolitan of New Zealand, made the apology at the Royal Commission into Abuse in Care on behalf of the bishops and congregational leaders in New Zealand.\n“Today, recognizing the importance of this moment, I apologize to you, on behalf of the bishops and congregational leaders of the Catholic Church in Aotearoa, New Zealand,” said Cardinal Dew, who is also the president of the New Zealand Catholic Bishops Conference.\n“I also apologize to you on behalf of those who preceded us as bishops and congregational leaders. We offer no excuses for their actions, or for ours, that have caused you harm.”\nCardinal Dew’s comments in Auckland was part of witness statements being recorded from faith-based institutions at the Abuse in Care inquiry that is underway to resolve historic and current abuse claims.\nPrime Minister Jacinda Ardern set up the Royal Commission in 2018 saying the country needed to confront “a dark chapter” in its history, and later expanded it to include churches and other faith-based institutions.\nAn interim report by the Commission in December found up to a quarter of a million children, young people and vulnerable adults were physically and sexually abused in New Zealand’s faith-based and state care institutions from the 1960s to early 2000s.\nThe inquiry found children, some from as young as nine months old, suffered years of abuse, which included rape and electric shock treatment, by staff at psychiatric and state care facilities, clergy and foster guardians.\n“We acknowledge that the systems and culture of the Church allowed abuse to occur. These systems and culture failed you and must change,” said Cardinal Dew.The Royal Commission will make recommendations to the government in its final report later this year. It is one of longest and most complex commissions of inquiry undertaken in New Zealand.",
        "author": ""
    },
    {
        "source": "https://newsinfo.inquirer.net/1411645/as-ph-ranking-in-happiness-index-drops-palace-pins-hope-on-vaccines",
        "date": "1:57 PM March 26, 2021",
        "title": "As PH ranking in happiness index drops, Palace pins hope on vaccines",
        "article_body": "\nMANILA, Philippines — Malacañang expressed hope that Filipinos will become happier once the COVID-19 vaccine becomes available to everyone following a report that the Philippines’ ranking fell in the latest World Happiness Report.\nThe  out of 149 countries in terms of happiness from its previous ranking of 52nd, according to the United Nation-sponsored 2021 World Happiness Report.\n\nIn a televised briefing, presidential spokesperson Harry Roque said he is saddened by the report as he attributed the decline to the COVID-19 pandemic.\n“Nalulungkot tayo na naging mas kakaunti ang mga maligaya sa bansa natin ngayon pero ito ay epekto ng pandemya,” Roque said.\n(We are sad that lesser Filipinos are happy in our country but this is because of the pandemic.)\n“Nandiyan naman po ang kumbaga pag-asa natin sa pagdating ng mga bakuna. So, inaasahan po natin na matapos mabakunahan ang lahat eh mas liligaya muli ang mga Pilipino,” he added.\n(Our hope is already here with the arrival of the vaccines. So we expect that once everyone is vaccinated, Filipinos will also be happier.)\nFinland remained the . It is followed by fellow European countries like Iceland, Denmark, Switzerland, and the Netherlands.",
        "author": "Krissy Aguilar"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411638/amid-line-jumpers-drilon-says-govt-should-ramp-up-vaccine-supply",
        "date": "1:51 PM March 26, 2021",
        "title": "Amid line-jumpers, Drilon says gov’t should ramp up vaccine supply",
        "article_body": "\nMANILA, Philippines — The national government should ramp up the supply of COVID-19 vaccines in the country to prevent incidents of line-jumping in the vaccination program, Senate Minority Leader Franklin Drilon said Friday.\nAccording to Drilon, the uncertainty on the supply and delivery of COVID-19 vaccines affect the confidence of the people in the ability of the government to implement an effective and efficient mass vaccination program.\n“This happens when we only have a million or so doses when what we need is at least 140 million doses to inoculate around 70 million Filipinos,” Drilon said in a statement.\n“People are worried about two things: coronavirus infections are hitting record-high each day and the fact that there is a woefully inadequate supply of vaccines. The government must ramp up vaccine supply. It all boils down to supply and demand,” the senator added.\nMoreover, Drilon said the credibility of the government to make the Filipinos follow the rules “is negatively affected by past incidents”, such as the reported illegal and unauthorized vaccination of government officials.\n“I leave it to the Department of Justice to determine possible violations when the prioritization provided for in COVID-19 Vaccination Program Act is not followed,” Drilon said.\nThe Department of Interior and Local Government (DILG) earlier issued show-cause orders to  for getting vaccinated against COVID-19 ahead of the prioritized sector.\nThe show-cause orders were addressed to Tacloban City Mayor Alfred Romualdez; T’boli, South Cotabato Mayor Dibu Tuan; Sto Niño, South Cotabato Mayor Sulpicio Villalobos; Legazpi City, Albay Mayor Noel Rasa; and Bataraza, Palawan Mayor Abraham Ibba.\nHealth Secretary Francisco Duque III and National Task Force (NTF) on COVID-19 chief implementer and vaccine czar Secretary Carlito Galvez Jr., meanwhile, both reminded Filipinos to follow the priority ranking in the government’s new coronavirus vaccination program.",
        "author": "Neil Arwin Mercado"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411626/active-covid-19-cases-in-quezon-city-now-more-than-7800",
        "date": "1:38 PM March 26, 2021",
        "title": "Active COVID-19 cases in Quezon City now more than 7,800",
        "article_body": "\nMANILA, Philippines — Quezon City now has nearly 7,900 active coronavirus disease (COVID-19) cases, with total infections reaching more than 43,500, disclosed Mayor Joy Belmonte on Friday.\nDuring a webinar organized by the University of the Philippines, Belmonte reported that as of March 26, Quezon City has a total of 43,559 COVID-19 cases.\nOf this number, 7,873 are active cases, 34,297 are recoveries, and 889 are deaths.\n“Every day ay tumataas yan ng mga 800 [to] 900 cases so medyo nakakabahala na nga ang sitwasyon dito sa ating lungsod,” Belmonte said.\nBelmonte said the Quezon City government has already established  Task Force Vax to Normal which is mandated to carry out the smooth rollout of the city’s vaccination program.\nThe city government earlier announced it is eyeing to vaccinate 1.6 million residents against COVID-19 during a period of from.\nMeanwhile, active COVID-19 cases in the Philippines are approaching the  as the Department of Health (DOH) reported a new record-high of 8,773 additional cases on Thursday.\nAccording to DOH, the recorded new infections pushed the active cases nationwide to 99,891 as of March 25 – the highest following the detection of more transmissible SARS-CoV-2 variants – as the country’s total case count reached 693,048 since the pandemic reached the Philippines in 2020.",
        "author": "Neil Arwin Mercado"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411625/owwa-492000-ofws-repatriated-since-start-of-pandemic",
        "date": "1:38 PM March 26, 2021",
        "title": "OWWA: 492,000 OFWs repatriated since start of pandemic",
        "article_body": "\nMANILA, Philippines — About 492,000 overseas Filipino workers (OFWs) have been repatriated and sent back to their home provinces since the start of the COVID-19 pandemic last year, the Overseas Workers Welfare Administration (OWWA) said Friday.\n“Approaching half a million mark na po tayo,” OWWA administrator Hans Cacdac said in a Laging Handa public briefing.\nAt present, there are about 7,000 recently repatriated OFWs who are quarantined in 135 hotels in the country, he added.\nAll repatriated OFWs were provided by the government with food, transportation, and hotel quarantine accommodation.\nDue to the emergence of new coronavirus variants, returning OFWs were required to undergo five days of quarantine first before getting swab-tested, which prolonged their stay in hotels from the previous one to three days to up to seven to nine days, Cacdac said.\nMeanwhile, about 450,000 displaced OFWs have been given P10,000 cash aid under the “DOLE-AKAP” program of the Department of Labor and Employment, he added.",
        "author": "Daphne Galvez"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411624/doh-depression-a-comorbidity-but-current-covid-vaccine-supply-reserved-for-health-frontliners",
        "date": "1:30 PM March 26, 2021",
        "title": "DOH: Depression a comorbidity, but current COVID vaccine supply reserved for health frontliners",
        "article_body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
        "author": "Cathrine Gonzales"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411615/7-others-mayors-1-councilor-may-also-get-show-cause-orders-for-jumping-vaccination-line",
        "date": "1:17 PM March 26, 2021",
        "title": "DILG to also serve show-cause orders on 8 other local execs for breaching vaccine priority list",
        "article_body": "\nMANILA, Philippines — Aside from the initial five local chief executives who got show-cause orders, seven other mayors and one councilor may also be asked to explain why they got their COVID-19 ahead of those in the priority list, Department of the Interior and Local Government (DILG) Undersecretary Epimaco Densing III said Friday.\n“If the approval of the [officer in charge] comes out today, we’ll have another eight that will be released,” Densing said in an interview over CNN Philippines when asked if the agency will issue more show-cause orders against local executives.\nDensing added that the show-cause orders may be issued after it got reports from Malacañang and the media that more mayors got inoculated early against COVID-19.\n“After verifying yesterday, we really found that they really had themselves vaccinated,” he said.\nPreviously,  were issued show-cause orders to explain their early inoculation despite not being on the government’s COVID-19 vaccination priority list.\nAside from the five local chiefs, the DILG said that  will also be asked to explain why Mark Anthony Fernandez got his first dose of the AstraZeneca vaccine even if the actor was not a medical frontliner.\nDensing was also of the belief that Fernandez was not suffering from comorbidities, contrary to Olivarez’s claim.",
        "author": "Katrina Hallare"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411618/dti-nixes-extension-of-gcq-bubble-beyond-april-4",
        "date": "2:46 PM March 26, 2021",
        "title": "DTI nixes extension of GCQ bubble beyond April 4",
        "article_body": "\nMANILA, Philippines — The Department of Trade and Industry (DTI) expressed hope that the general community quarantine (GCQ) bubble placed over Metro Manila and four other nearby provinces will not be extended beyond April 4, DTI Undersecretary Ruth Castelo said Friday.\nIn a televised briefing, Castelo said it is possible to strike a balance between health and the reopening of the economy for as long as the public follows the minimum health protocols.\n“Kung tatanungin mo ang DTI, gusto na sana natin na mag open na ulit sa April 5,” Castelo said when asked if the DTI is keen on possibly extending the GCQ bubble.\n(If you were to ask the DTI, we would want to open again on April 5.)\n“That’s why we appeal to everyone, lahat tayo sama sama, tulong tulong na mapababa yung surge para makapagopen na tayo tuluy tuloy on April 5,” she added.\n(That’s why we are appealing to everyone, let us all help each other in decreasing the surge so we can open again on April 5.)\nRestaurants, cafes, and establishments were limited to delivery, take-out, and outdoor dining during the two-week GCQ bubble.\nIn Metro Manila, gyms, spas, and internet shops were ordered closed during the .\nDTI Secretary Ramon Lopez has also earlier rejected possible tighter restrictions, saying it will possibly lead to  beyond the COVID-19 pandemic.",
        "author": "Krissy Aguilar"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411613/iatf-allows-prc-to-conduct-licensure-exams-in-may-june-palace",
        "date": "2:37 PM March 26, 2021",
        "title": "IATF allows PRC to conduct licensure exams in May, June — Palace",
        "article_body": "\n\nMANILA, Philippines — The Inter-Agency Task Force on the Management of Emerging Infectious Diseases (IATF) has allowed the Professional Regulatory Commission (PRC) to conduct licensure exams in May and June, Malacañang said Friday.\n“Inaprubahan ng IATF ang request ng PRC na magsagawa ng licensure exams for professionals sa Mayo at Hunyo ngayong taon habang estriktong pinatutupad ang health protocols ng Department of Health,” Presidential spokesman Harry Roque announced in a pre-taped interview over Laging Handa public briefing.\n(The IATF has approved the request of the PRC to conduct licensure exams for professionals in May and June this year while strictly enforcing health protocols of the Department of Health.)\nExaminees in areas under general community quarantine (GCQ) are discouraged to travel to areas under the less stringent modified general community quarantine (MGCQ) to avoid the spread of COVID-19, Roque said.\nLast year, PRC postponed  due to the COVID-19 pandemic.\nFrom January to March this year, the PRC also conducted licensure exams after approval by the IATF.\nPRC chairman Teofilo Pilando Jr. earlier said the agency has scheduled  this year to make up for the low number of exams conducted in 2020 due to the COVID-19 pandemic.",
        "author": "Daphne Galvez"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411611/new-york-poised-to-legalize-marijuana-as-lawmakers-agree-on-terms-reports",
        "date": "2:35 PM March 26, 2021",
        "title": "New York poised to legalize marijuana as lawmakers agree on terms: reports",
        "article_body": "\nNEW YORK — Democrats, who control the New York legislature, have come to terms on a measure to legalize marijuana, which would make the state the 15th in the country to allow recreational use of the drug, according to two reports on Thursday.\nThe proposed bill, which had eluded lawmakers’ attempted agreements for years, would establish a regulatory structure for controlling marijuana sales, according to CNN, which cited a legislative source familiar with negotiations and an internal legislative memo that it obtained.\nThe proposed bill, would apply a 13% excise tax to retail marijuana sales and would eventually allow New Yorkers who are at least 21 years old to grow plants at home, CNN said.\nThe bill, the terms of which were still being reviewed, could go to a vote in the Assembly and Senate as early as next week, The New York Times said, citing three people familiar with the negotiations.\nGovernor Andrew Cuomo is on board with the agreement, which was negotiated by Assembly Majority Leader Crystal Peoples-Stokes and Senate Finance Committee Chair Liz Krueger, the Times reported.\nSpokespersons for Cuomo, Peoples-Stokes and Krueger did not immediately respond to requests for conformation.\nNew York, the country’s fourth most populous state, would join 14 others, including neighboring New Jersey, that permit adult consumption of marijuana for recreational use, according to NORML, which opposes its prohibition.\nMost of the other states legalized recreational use of the drug through popular referendums.\nA total of 36 states allow marijuana for medical purposes, NORML said.\nIn a statement on Thursday, NORML cited studies by the Legal Aid Society and the Drug Policy Alliance showing enforcement of New York’s marijuana laws had fallen disproportionately on non-white people.\nA key part of the state lawmaker’s pending agreement is aimed at making reparations for the war on marijuana by earmarking much of tax revenue from its sales for non-white communities and setting aside sales licenses for minority business owners, the Times said.\n“When this bill is finally voted on and signed, New York will be able to say we have finally undone damaging criminal justice laws that accomplished nothing but ruining people’s lives,” Krueger told the paper.\n“For me this is a lot more than about raising revenue: It’s about investing in the lives of the people that have been damaged,” Peoples-Stokes told the Times.",
        "author": ""
    },
    {
        "source": "https://newsinfo.inquirer.net/1411592/makabayan-bloc-seeks-probe-on-red-tagging-of-mandaluyong-judge",
        "date": "2:14 PM March 26, 2021",
        "title": "Makabayan bloc seeks probe on red-tagging of Mandaluyong judge",
        "article_body": "\nMANILA, Philippines — The Makabayan bloc is seeking an inquiry into the alleged red-baiting of Mandaluyong Regional Trial Court judge Monique Quisumbing-Ignacio following the dismissal of criminal charges filed by state forces against a red-tagged journalist and a trade unionist.\nThe House bloc filed House Resolution No. 1674, which calls on the House Committee on Justice to conduct the investigation amid threats to the life and security of Quisumbing-Ignacio, which lawmakers said came at a time “when threats against members of the legal profession are in an all-time high.”\nOn March 5, , presiding judge of the Mandaluyong City Regional Trial Court (RTC) Branch 209, issued an order quashing an earlier search warrant after a preliminary hearing into the cases filed against alternative media person Lady Ann Salem and union leader Rodrigo Esparago, who was arrested and charged for illegal possession of firearms and explosives.\nThe search warrants were secured by state forces from a Quezon City Court.\nDays after Quisumbing-Ignacio’s release order, a  at the corner of Shaw Boulevard and EDSA, stating that the RTC judge was a member of the Communist Party of the Philippines.\nThe , in a rare move, condemned the killings and threats against judges and lawyers, saying such actions were “no less than an assault on the Judiciary.”",
        "author": "Katrina Hallare"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411557/2-drug-suspects-dead-in-cavite-busts-75-alleged-pushers-held",
        "date": "2:11 PM March 26, 2021",
        "title": "2 drug suspects dead in Cavite busts; 75 alleged pushers held",
        "article_body": "\nLUCENA CITY –– Two drug suspects were killed in buy-bust operations that ended in alleged armed encounters in Cavite province over the past two days, the police said.\nColonel Marlon Santos, Cavite police chief, said in a report Thursday that one of the drug pushers, Luisito Pineda, was killed on the same day in a drug sting at Barangay Ibayo Silangan in Naic town.\nThe police reportedly found one caliber .22 pistol with five bullets and two empty shells from Pineda’s body.\nOperatives also recovered 13 plastic sachets of suspected shabu (crystal meth), the police added.\nOn March 24, Santos also reported the death of Sonny Boy Sagrado after he engaged the policemen in a gunfight in Barangay Manggahan in General Trias City.\nA caliber .38 revolver and four sachets of shabu weighing 20 grams were recovered from the slain suspect.\nThe report said 75 other drug suspects were also nabbed in 49 buy-busts in the province during the past two days.\nAuthorities seized 226 sachets of shabu, 22 sachets, and three “bricks” of marijuana, drug paraphernalia, and cash believed to be from the sale of illegal drugs.\nLZB",
        "author": "Delfin T. Mallari Jr."
    },
    {
        "source": "https://newsinfo.inquirer.net/1411576/2-drug-suspects-slain-in-shootout-with-bulacan-cops",
        "date": "2:10 PM March 26, 2021",
        "title": "2 drug suspects slain in ‘shootout’ with Bulacan cops",
        "article_body": "\nMARILAO, Bulacan –– Two suspected drug traders were killed in a buy-bust operation here after reportedly engaging the police in a shootout on Wednesday.\nSlain were Edison Lim Dizon from Marilao town and Gaudioso Juarez Jr. from Pandi town, said Col. Lawrence Cajipe, Bulacan police director.\nDizon was on the watch list of drug personalities in Marilao and Pandi.\nCajipe said the two suspects were the first to fire shots after sensing they were selling “shabu” (crystal meth) to undercover agents during the sting in Barangay Tabing-ilog at 10:20 p.m.\nRecovered from the suspects were 22 sachets of shabu, the marked money drug paraphernalia, a .38-caliber revolver, and ammunition. INQ\nLZB",
        "author": "Carmela Reyes-Estrope"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411597/healthcare-workers-in-ncr-bubble-cebu-davao-to-get-400000-sinovac-vaccines",
        "date": "2:06 PM March 26, 2021",
        "title": "Healthcare workers in NCR bubble, Cebu, Davao to get 400,000 Sinovac vaccines",
        "article_body": "\n\nMANILA, Philippines — The government will be allocating most of the recently delivered  of Sinovac BioTech for healthcare workers in areas most affected by new coronavirus variants, Malacañang said Friday.\nThis includes healthcare workers in the National Capital Region “bubble” (NCR, Batangas, Rizal, Laguna, Cavite) Cebu and Davao, Presidential spokesman Harry Roque said.\n“Nagkaroon na ng desisyon ang ating NITAG (National Immunization Technical Advisory Group) na ‘yung mga kakarating na pinakahuling donasyon ng China na 400,000 na Sinovac ay ibibigay ang karamihan nito doon sa pinaka-apektado ng new variants kasama na ang NCR plus, Cebu, at Davao,” Presidential spokesman Harry Roque announced in a pre-taped interview over Laging Handa briefing.\n(The NITAG has come up with a decision to concentrate most of the 400,000 Sinovac jabs to areas most affected by the new variants including NCR plus, Cebu, at Davao.)\nThe vaccine shots, which arrived in the Philippines on Wednesday, were donated by the Chinese government.\nThe donated vaccines were in addition to the initial 600,000 doses that arrived in the country last February 28.\nOne million more doses of Sinovac vaccines purchased by the national government will arrive on March 29.\nThe government is currently in the process of vaccinating healthcare workers in the country, who are the top priority in the vaccination program.",
        "author": "Daphne Galvez"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411588/1921-hurdle-2021-medical-technology-licensure-exam-pangasinan-grad-is-topnotcher",
        "date": "2:03 PM March 26, 2021",
        "title": "1,921 hurdle 2021 Medical Technology licensure exam; Pangasinan grad is topnotcher",
        "article_body": "\n\n\n\n\n\n\n\nThe complete list of passers can be viewed at:",
        "author": "Neil Arwin Mercado"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411591/govt-oks-once-a-day-church-gatherings-of-10-percent-capacity-for-holy-week",
        "date": "1:56 AM March 26, 2021",
        "title": "Gov’t OKs once-a-day church gatherings of 10 percent capacity for Holy Week",
        "article_body": "\n\nMANILA, Philippines — The government has allowed once-a-day religious gatherings of up to 10 percent venue capacity in churches for the coming Holy Week or from April 1 to April 4, Malacañang announced on Friday.\n“Pinayagan po ng inyong IATF [Inter-Agency Task Force for the Management of Emerging Infectious Diseases] ang once a day religious gatherings mula a uno hanggang a kwatro ng Abril…Kinakailangan sundin ang maximum indoor capacity na 10 porsyento sa lahat ng oras,” presidential spokesperson Harry Roque said in a televised briefing.\n(The IATF has allowed once-a-day religious gatherings from April 1 to April 4. They have to follow the maximum indoor capacity of 10 percent at all times.)\nRoque said entry to churches and venues of worship activities “via reservation” is encouraged to ensure compliance to the 10 percent capacity limitation.\n“Bawal ang pagtitipon tipon o pagsasagawa ng religious activities sa labas ng simbahan o venue,” he said.\nAudiovisual feeds of religious activities outside churches are also not allowed to prevent Mass goers from crowding.\nLive singing will be “strictly limited,” while recorded singing is highly encouraged.\n“Hindi lang po ito para sa Simbahang Katoliko, lahat po ng pananampalataya kasama na rin po ang ating kapatid na Muslim, mga Shinto, pupuwede pong once a day, 10 percent capacity, April 1 to April 4,” Roque said.\n(This is not just for the Catholic Church, this is for all faithful including Muslims, Shinto, religious gatherings once a day are allowed at 10 percent capacity from April 1 to 4.)\nEarlier, the government barred all Mass gatherings including religious activities in areas under the general community quarantine (GCQ) bubble which covers Metro Manila, Bulacan, Rizal, Cavite, and Laguna to stem the surge in COVID-19 cases.",
        "author": "Krissy Aguilar"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411584/cbcp-seeks-clearance-to-hold-holy-week-church-gatherings-at-10-capacity",
        "date": "1:46 AM March 26, 2021",
        "title": "CBCP seeks clearance to hold Holy Week church gatherings at 10% capacity",
        "article_body": "\nMANILA, Philippines — The Catholic Bishops’ Conference of the Philippines (CBCP) has asked the national government to allow the holding of religious gatherings at 10 percent capacity of churches within the NCR Plus bubble during the Holy Week.\nFather Genaro Diwa, Executive Secretary of the CBCP Episcopal Commission on Liturgy, said Friday that he represented the CBCP to make the request before the Inter-Agency Task Force for the Emerging Infectious Diseases (IATF-EID.)\n“Two days ago I was asked to represent the CBCP to the working committee before the IATF and we made an appeal to the IATF if we can be granted at least for the three days celebrations namely Holy Thursday, Good Friday, Black Saturday, and added is Easter Sunday of course because that is the culmination, if we can be granted the allowance of even at least 10 percent church attendance,” he said in an online press briefing.\n“I made the representation and they tried to ask me all the parameters that we are putting in place in order to ensure safety protocols because of the growing number of the cases of COVID,” he added.\nAccording to Diwa, the request covers areas in the NCR Plus that were placed under general community quarantine from March 22 to April 4, such as the Metro Manila, Cavite, Rizal, Laguna, and Bulacan.\nThe IATF earlier prohibited , including religious gatherings, in these areas during the period of GCQ amid the rising number of COVID-19 cases.\nDiwa said he was told that the decision of the IATF on their request will be announced this Friday by presidential spokesperson Harry Roque.",
        "author": "Cathrine Gonzales"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411582/deped-vows-action-against-those-responsible-for-superspreader-seminars-in-zambales",
        "date": "1:43 AM March 26, 2021",
        "title": "DepEd vows action against those  responsible for ‘superspreader’ seminars in Zambales",
        "article_body": "\nSAN ANTONIO, Zambales –– The Department of Education (DepEd) has vowed to impose disciplinary actions on those who breached health protocols during the seminars that triggered an outbreak of the coronavirus disease (COVID-19).\nIn a statement released Wednesday, the DepEd said it had no prior approval of face-to-face activities related to In-Service Training and other seminars for teachers.\n“The Department strictly adheres to the guidelines and required health protocols on work and office arrangement set by the IATF (Inter-Agency Task Force), the Department of Health and the Civil Service Commission,” it said.\nDepEd said it is investigating the alleged virus transmission and exposure of personnel of the Zambales Schools’ Division Office during a division-initiated training in early March.\n“Appropriate disciplinary actions [against] authorities who breached the protocols will be taken once the investigation is finalized,” it added.\nAt least 49 DepEd employees had tested positive for COVID-19 after attending two separate seminars held on March 1-6 and March 9-13 in Zambales beach resorts.\nThe infection source was the guest speaker, said provincial health director Dr. Noel Bueno.\nA total of 390 DepEd employees, mostly school heads and teachers, attended the seminars.\nThe “superspreader” activity also infected seven workers of one of the two beach resorts that hosted the seminars, Bueno said.\nAn outbreak of COVID-19 at Barangay Batonlapoc in Botolan town was also traced to five DepEd employees who attended the seminars. INQ\nLZB",
        "author": "Joanna Rose Aglibot"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411575/kabataan-party-list-files-manifestation-of-intent-to-join-2022-polls",
        "date": "0:46 AM March 26, 2021",
        "title": "Kabataan Party-list files manifestation of intent to join 2022 polls",
        "article_body": "\nMANILA, Philippines — Kabataan Party-list, which is a part of the current Makabayan bloc in the House of Representatives, has filed its manifestation of intent to join the 2022 elections despite previous disqualification threats.\nKabataan Party-list Rep. Sarah Jane Elago said the manifestation of intent was filed both electronically and via courier before the Commission on Elections (Comelec).\n“Sa kabila ng banta ng disqualification, at matinding atake sa Kabataan, hindi kami papipigil na lumahok at manindigan. To fight for health, aid, education, jobs, and justice now is a matter of survival amid the pandemic, and the climate and human rights emergencies,” Elago said in a statement.\n“To strengthen our unity and act now against all forms of abuse, discrimination and tyranny is our assertion for a better future,” she added.\nElago also said the youth are at the helm of “amplifying voices” for an effective response and recovery from the coronavirus pandemic.\nThe lawmaker likewise called on those who are turning 18 years old, and those who have not registered yet to register at the Comelec.\n“Don’t just get involved, get organized. Actively participate in the campaign for registration and education for voter’s empowerment,” Elago said.\nIn December 2020, the Makabayan bloc cried foul over plans to  through the Comelec, claiming that it may be a scheme to cripple the opposition in the next elections.\nIn March 2021, , which is also a part of the Makabayan bloc, also filed its own manifestation of intent to join the 2022 national elections “as an act of defiance” to the disqualification case filed against it by the National Task Force to End Local Communist Armed Conflict.",
        "author": "Neil Arwin Mercado"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411568/dilg-should-at-least-reprimand-local-execs-who-jumped-covid-vax-line-mayor",
        "date": "0:38 AM March 26, 2021",
        "title": "DILG ‘should at least reprimand’ local execs who jumped COVID vax line — mayor",
        "article_body": "\nMANILA, Philippines — The Department of the Interior and Local Government (DILG) should at least reprimand the local executives who skipped the line on the government’s COVID-19 vaccination priority list, Marikina City Mayor Marcelino Teodoro said Friday.\nTeodoro, in an interview over the ABS-CBN News Channel, added that despite local government officials moving up the , it is not the right time for them to get vaccinated.\n“At least I think they should be reprimanded. We are included now in the priority list but it’s not yet our schedule,” Teodoro said when asked what should the DILG do to the erring mayors who got vaccinated.\nThis, as the DILG, issued show-cause orders against  to explain why they got vaccinated ahead of medical frontliners.\nAccording to the government’s  medical frontliners are the first to get the vaccines, to be followed by senior citizens and by persons with comorbidities.\nWhen asked what he thought about the mayors’ reason that they were inoculated to boost public confidence in the vaccines, Teodoro answered: “I think three weeks ago or a month ago, that is necessary to lead by example to show confidence in the process of vaccination.”\nTo recall, Teodoro also asked if he can get as health workers in Marikina were afraid to get the Sinovac vaccines. His request, however, was denied as the National Immunization Technical Advisory Group said the vaccines should go to healthcare workers first.",
        "author": "Katrina Hallare"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411567/doh-tracking-down-health-workers-in-covid-19-vax-priority-list-spox",
        "date": "0:26 AM March 26, 2021",
        "title": "DOH tracking down 600,000 health workers in COVID-19 vax priority list — spox",
        "article_body": "\nMANILA, Philippines — The Department of Health (DOH) said Friday it is still searching for around 600,000 healthcare workers who should be included in the master list to receive COVID-19 vaccine jabs.\nAccording to DOH Undersecretary and spokesperson Maria Rosario Vergeire, around 1.8 million healthcare workers in the country should be prioritized in the vaccination program. However, she noted that some of the healthcare workers are working freelance or are affiliated with private facilities.\n“Sa ngayon kapag tiningnan po natin ‘yung mga nabakunahan at tsaka naimasterlist ng ating local government units at implementing sites, ‘yung ating 1.8 [million] na estimate na healthcare workers ay hindi pa po natin sila nasasagad,” she said in an interview with ABS-CBN’s Teleradyo on Friday.\n(Right now if we will look at the list of vaccinees and those in the masterlist of our local government units, not all of the 1.8 million estimated healthcare workers have been vaccinated yet.)\n“Hindi pa po natin sila nahahanap, dahil nga po maraming mga healthcare workers natin ngayon dealing with COVID are not affiliated in any of the institutions or facilities that we have right now,” she added.\n(We have yet to find some of them, because many healthcare workers dealing with COVID are not affiliated with any of the institutions or facilities that we have right now.)\nIn an online press briefing, Vergeire said that the current masterlist of vaccination sites across the country contain the names of 1.2 million healthcare workers.\n“Doon sa estimate natin bago tayo nag-umpisa we have a 1.8 [million] total estimate for our healthcare workers, so meron tayong difference dyan na mga 600,000,” she added.\n(We estimated that there were 1.8 million healthcare workers before we started the vaccination, so the difference in the figures is 600,000.)\nAccording to Vergeire, the DOH has also received anecdotal reports that doctors in private establishments have yet to receive their vaccines.\nShe said the local government units have been tasked to locate the remaining healthcare workers who have yet to receive the vaccines.\nAs of March 23, the country has administered 508,332 doses of COVID-19 vaccines as first shots.\nThe country has so far received a total of 1,525,600 doses of Sinovac and AstraZeneca vaccines. The vaccines were donated by the Chinese government and the global vaccine sharing pool COVAX as the country awaits the delivery of its procured vaccines.",
        "author": "Cathrine Gonzales"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411570/manila-eyes-to-vaccinate-1700-frontline-workers-on-friday",
        "date": "0:26 AM March 26, 2021",
        "title": "Manila eyes to vaccinate 1,700 frontliners on Friday",
        "article_body": "",
        "author": ""
    },
    {
        "source": "https://newsinfo.inquirer.net/1411561/actors-covid-19-vaccination-inappropriate-says-marikina-city-mayor",
        "date": "9:47 AM March 26, 2021",
        "title": "Actor’s COVID-19 vaccination inappropriate, says Marikina City mayor",
        "article_body": "\n\n\n\n\n\n",
        "author": "Katrina Hallare"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411554/lacson-slams-malicious-photo-as-dirty-hatchet-job",
        "date": "9:37 AM March 26, 2021",
        "title": "Lacson slams ‘malicious’ photo as ‘dirty hatchet job’",
        "article_body": "\nMANILA, Philippines — Senator Panfilo Lacson has slammed as a “dirty hatchet job,” a “malicious” photo circulating in social media which he said is insinuating that he is already posturing for the 2022 elections.\nLacson said Thursday evening that he has instructed his staff to identify those behind the circulation of his photo with the caption “P-angulong I-aayos N-a muli ang G-obyerno.” (the president who will fix the government.)\n“It is a dirty hatchet job, to put it mildly – being circulated at a time when some propagandists, with the aid of troll farms, are accusing me of politicking by criticizing the handling of the pandemic,” he said.\n“Now comes this photo to make it appear that I’m really politicizing the situation—and nothing can be further from the truth,” he added.\nThe senator noted that the photo circulated shortly after presidential spokesperson Harry Roque accused those criticizing the government’s handling of the COVID-19 pandemic of  during President Rodrigo Duterte’s televised address to the nation on Monday evening.\n“Really? Harry, are you serious? Just because I criticize, pamumulitika na (it is politicking already)?” Lacson replied to Roque in an earlier\nLacson said his office has already reported the “unauthorized” photo to Facebook.\nThe senator has repeatedly said he has not decided yet on his political plans for the 2022 national elections.",
        "author": "Cathrine Gonzales"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411553/canada-calling-hong-kong-residents-shift-billions-abroad-after-clampdown",
        "date": "9:28 AM March 26, 2021",
        "title": "Canada calling? Hong Kong residents shift billions abroad after clampdown",
        "article_body": "\nTORONTO  – As China imposed a sweeping national security law in Hong Kong last year after massive protests, residents of the city moved tens of billions of dollars across the globe to Canada, where thousands are hoping to forge a new future.\nCapital flows out of Hong Kong banks reaching Canada rose to their highest levels on record last year, with about C$43.6 billion ($34.8 billion) in electronic funds transfers (EFT) recorded by FINTRAC, Canada’s anti-money laundering agency, which receives reports on transfers above C$10,000.\nThe previously unreported outflows, the highest since 2012 when the earliest FINTRAC records are available, are the first evidence of a significant flight of capital overseas from the Asian financial hub following the security turmoil.\nOne Canadian lender, Equitable Bank, also told Reuters it had seen a surge in deposits from Hong Kong just after the new law was introduced in June 2020. Critics say the law was aimed at stifling dissent, an allegation denied by Beijing which says it was needed to strengthen national security.\nThe Hong Kong government has said the city has not seen significant capital outflows since the anti-government unrest first began in 2019, when a now-shelved bill that would have allowed extraditions to mainland China was proposed.\nThe record transfers, up 46% from 2016 and up 10% from 2019, came in a year when Hong Kong police froze the accounts of several people linked to pro-democracy protests, triggering concern among some residents about asset safety.\nThe outflows represent only 1.9% of Hong Kong’s total bank deposits in 2020. But, at the same time, the FINTRAC data captures only a fraction of total legal inflows into the Canadian economy because many transactions are not included, such as transfers via cryptocurrencies, between financial institutions, or under C$10,000, said spokesman Darren Gibb.\nThe agency has seen a steady increase in overall EFT reporting, consistent with global trends, he said.\nAnd it’s not just money.\nReuters interviewed a dozen immigration consultants, lawyers, and real estate brokers who provided a window into how many Hong Kong residents are eager to start a new life in Canada and bring with them millions of dollars, once pandemic-induced travel restrictions end.\nCanadian visa applications from Hong Kong, excluding visitors’ visas, rose 10% to 8,121 in 2020, indicating further capital flows from the city are likely. Britain and Australia are expected to be other favored destinations for Hong Kong residents.\nAndrew Lo, chief executive of immigration consultancy Anlex in Hong Kong, is looking to expand into wealth management services in Canada, which he believes will be “a booming market for new immigrants, especially from Hong Kong.”\nLo said he helped around 36 families emigrate to Canada in the past 12 months, each bringing C$1.5 million on average.\n(For graphic on financial transfers to Canada by Hong Kong residents – https://graphics.reuters.com/HONGKONG-SECURITY/CANADA2/yxmvjwyeopr/index.html)\nDespite the cash leaving Hong Kong, it continues to receive inflows on a net basis, with total deposits growing by 5.4% in 2020 to HK$14.5 trillion ($1.9 trillion), according to the Hong Kong Monetary Authority.\n“As an international financial center (IFC), Hong Kong handles capital inflows and outflows which arise from all sorts of needs on a regular basis,” a central bank spokeswoman told Reuters in response to the questions about outflows to Canada.\n“This is just normal in keeping with the nature and function of an IFC.”\nRobust cash flows from mainland China via the Stock Connect initiative and strong demand for some of Hong Kong’s initial public offerings (IPOs) last year have helped capital inflows into Hong Kong, analysts and bankers have said.\nCanada is a second home for many Hong Kong residents after their families moved to the Vancouver and Toronto areas ahead of the British handover of its former colony to China in 1997. After obtaining Canadian citizenship, many returned to Hong Kong, which is now home to about 300,000 Canadians – one of the largest Canadian communities abroad.\nBut following the 2020 security law, more Hong Kong residents want to make their home in Canada, which took steps https://www.canada.ca/en/immigration-refugees-citizenship/news/2020/11/canada-announces-immigration-measures-supporting-hong-kong-residents-and-canadians-in-hong-kong.html late last year to make it easier for them to obtain work permits and permanent residency, according to immigration consultants and lawyers.\nThe residents cite eroding rights and freedoms, and a better education for their children as reasons for their choice, and many are selling their Hong Kong properties and bringing their money with them, they said.\nPolitical developments have prompted people to consider what will happen if things decline, and to look at Canada as an option, said Canadian immigration attorney Evelyn Ackah. “Right now, it’s just an option. I don’t see a mass exodus. It’s people looking around, saying ‘can I be somewhere else if I need to?'”\n(For graphic on Canada visa applications from Hong Kong – https://graphics.reuters.com/HONGKONG-SECURITY/CANADA/xegvbgeldpq/index.html)\nEven as departures are delayed by travel restrictions and slower immigration processing times, some have already begun moving money into Canadian accounts, according to immigration experts.\nToronto-based Equitable Bank has seen a “remarkable increase” in balances in existing accounts linked to Hong Kong phone numbers, said Mahima Poddar, group head of personal banking.\nAverage balances in these accounts were up 30% between June and mid-March, versus a 4% rise in accounts with non-Hong Kong phone numbers.\nThe country’s large banks either didn’t respond to requests for, or declined to comment on, any influxes from Hong Kong.\nJean-Francois Harvey, a Canadian lawyer based in Hong Kong who specializes in immigration for high-net-worth individuals, has seen a five-fold increase in clients seeking to move to Canada since mid-2020. His clients have transferred at least C$1 million and, more commonly, between C$5 million and C$10 million in the last 12 months.\n“There’s been an incredible increase in demand especially for Canada in Hong Kong, so much that in the middle of COVID-19, I had to double the team and the size of the office in Hong Kong,” said Harvey, worldwide managing partner for Harvey Law Group.\n“This is more than a spike. This is a wave.”\nHong Kong-based attorney Clifford Ng, who himself immigrated to Canada in 1975 and returned to Hong Kong in 1995, said he has seen a four-fold increase in inquiries about the tax implications of moving to Canada.\nCanada is not the only destination expected to see inflows from Hong Kong as residents look to leave, though.\nBritain’s government expects that as many as 321,600 Hong Kong residents will migrate there over the next five years, with almost half of those in 2021. Based on this, Bank of America said in January it expects emigration-related outflows to reach HK$280 billion ($36.1 billion) this year.\nSome of the money coming into Canada is likely to flow into real estate, property consultants said.\nIn the first 10 weeks of 2021, Hong Kong hosted nearly a third more exhibitions of new-build properties by Canadian developers than in the same period in 2019, according to data from Eli McGeever, vice president of international property at Soho App.\nExhibitions in 2020 were affected by Hong Kong’s first wave of COVID-19 lockdowns.\nAlisha Ma, founder of immigration consultancy Halcyon Counsel, said Hong Kong families are looking at properties in Toronto and Vancouver, but waiting until they obtain permanent residency to avoid foreign buyers’ taxes.\nKeelan Chapman, founder of the Canadian Real Estate Investment Centre (HK), said he has seen a noticeable increase in buyers looking for larger properties in good school areas for eventual self-use, rather than solely for investment.\nHe said many of his clients, most of whom are Hong Kong residents with Canadian passports, have accelerated timelines for returning to Canada to around five years on average, from around eight years previously.\n“There’s no rush to move back to Canada tomorrow,” he said. “It’s more of a long picture view.”\n($1 = 1.2546 Canadian dollars; $1 = 7.7669 Hong Kong dollars)",
        "author": ""
    },
    {
        "source": "https://newsinfo.inquirer.net/1411547/taal-volcano-update-alert-level-2-stays-270-volcanic-quakes-recorded-in-24-hours",
        "date": "9:19 AM March 26, 2021",
        "title": "Taal Volcano update: Alert level 2 stays, 270 volcanic quakes recorded in 24 hours",
        "article_body": "\nMANILA, Philippines — Taal Volcano remains under Alert Level 2 reported the Philippine Institute of Volcanology and Seismology (Phivolcs) Friday morning after 270 volcanic earthquakes were recorded in the area in the last 24 hours.\nAccording to 8 a.m. Phivolcs bulletin, 193 of the recorded earthquakes were “episodes of volcanic tremor” lasting from 1 to 12 minutes, while 77 were low-frequency volcanic earthquakes.\n“Activity at the Main Crater consisted of weak emission of steam-laden plumes from fumarolic vents that rose ten meters,” Phivolcs said.\nPhivolcs likewise said temperature highs of 71.8 degrees Celcius and pH (measure of water acidity) of 1.59 were last measured from the Main Crater Lake on March 4 and February 12, 2021, respectively.\nFurther, Phivolcs said data analysis indicated “a very slow and steady inflation and expansion of the Taal region since after the January 2020 eruption.”\n“These parameters may indicate increased magmatic activity at shallow depths beneath the edifice,” Phivolcs added.\nUnder Alert Level 2, sudden steam-driven or phreatic explosions, volcanic earthquakes, minor ashfall, and lethal accumulations or expulsions of volcanic gas can occur and threaten areas within and around the Taal Volcano Island (TVI).\n“DOST-PHIVOLCS strongly recommends that entry must be strictly prohibited into Taal Volcano Island, Taal’s Permanent Danger Zone or PDZ, especially the vicinities of the Main Crater and the Daang Kastila fissure, and occupancy and boating on Taal Lake,” Phivolcs said.\nState volcanologists raised the status of Taal Volcano to Alert Level 2 more than a year after its last phreatic eruption in January 2020.",
        "author": "Neil Arwin Mercado"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411545/exposure-to-protection-from-covid-19-essential-for-mayors-job-locsin",
        "date": "9:08 AM March 26, 2021",
        "title": "Mayors need protection from COVID-19 – Locsin",
        "article_body": "\nMANILA, Philippines — City and town mayors need to be protected from COVID-19 as they are likewise exposed to the virus like frontliners, Foreign Affairs Secretary Teodoro Locsin said Friday.\nLocsin made the remark amid reports of some city and municipal mayors receiving COVID-19 vaccines ahead of medical frontliners.\n“Just bad taste but mayors need to expose themselves to the public and COVID infection. Exposure and protection essential to local public officials’ job as to front-liners doing theirs,” Locsin said in a tweet.\n“Let’s move on to real problems of supply and delivery,” he added.\nJust bad taste but mayors need to expose themselves to the public…& Covid infection. Exposure and protection essential to local public officials' job as to front-liners doing theirs. Let's move on to real problems of supply and delivery.\n— Teddy Locsin Jr. (@teddyboylocsin)\n\nThe Department of the Interior and Local Government (DILG) earlier issued show-cause orders to five mayors for getting vaccinated against COVID-19 ahead of the prioritized individuals.\nThe show-cause orders were addressed to , T’boli, South Cotabato Mayor Dibu Tuan, Sto Niño, South Cotabato Mayor Sulpicio Villalobos, Legazpi City, Albay Mayor Noel Rasa and Bataraza, Palawan Mayor Abraham Ibba.\nHealth Secretary Francisco Duque III and National Task Force (NTF) on COVID-19 chief implementer and vaccine czar Secretary Carlito Galvez Jr., meanwhile, both reminded Filipinos to adhere to the priority list of the government’s COVID-19 vaccination program.\nAside from the mayors,  likewise got vaccinated despite not being on the government’s priority list.",
        "author": "Neil Arwin Mercado"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411542/marikina-has-nearly-1500-active-covid-19-cases-highest-since-start-of-pandemic-mayor",
        "date": "8:42 AM March 26, 2021",
        "title": "Marikina City’s active COVID-19 cases reach record high – Teodoro",
        "article_body": "\nMANILA, Philippines — Marikina City currently has nearly 1,500 active COVID-19 cases, the most since the start of the pandemic last year, Mayor Marcelino Teodoro disclosed Friday.\nTeodoro said the city has 1,486 active COVID-19 cases as of March 26.\n“This is the highest number of cases that we’re having since the start of the pandemic last year,” Teodoro said in an interview on ABS-CBN News Channel.\nTeodoro said that in January this year, the city only had 112 cases. By March, however,  the number of cases increased to 277 and eventually to nearly 1,500.\n“We could see that it has increased almost ten-fold the number that we have prior the start of the month. We are being overwhelmed and we’re struggling to do aggressive and proactive contact tracing, isolation,” Teodoro said.\nHe assured that the city government has measures in place to control the spread of the virus such as reverse isolation.\nActive COVID-19 cases in the Philippines are approaching the 100,000-mark as the Department of Health (DOH) reported a new record-high 8,773 additional cases on Thursday.\nAccording to DOH, the recorded new infections pushed following the detection of more transmissible SARS-CoV-2 variants –as the country’s total case count reached 693,048 since the pandemic reached Philippine shores in 2020.",
        "author": "Neil Arwin Mercado"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411538/hot-weather-expected-in-large-part-of-luzon-33-degrees-maximum-in-metro-manila",
        "date": "7:29 AM March 26, 2021",
        "title": "Pagasa: Expect warm Friday with scattered rain showers",
        "article_body": "\n\nMANILA, Philippines — Warm weather is expected in many parts of Luzon on Friday, with the temperature possibly reaching a maximum of 33 degrees Celsius in Metro Manila, the Philippine Atmospheric, Geophysical, and Astronomical Services Administration (Pagasa) reported.\nCloudy skies and scattered rain showers, however, are possible in the afternoon.\nThe state weather bureau said the northeasterly surface wind flow will affect extreme northern Luzon while the easterlies will prevail over the rest of the country, signifying the approaching dry season.\nPagasa reported that the temperature in Tuguegarao City is likewise expected to rise to 33 degrees Celsius and slightly lower at 32 degrees Celsius in Laoag City, Lagazpi City and Puerto Princesa City.\nThe mercury is forecast to rise to 34 degrees Celsius in Davao and Zamboanga.\nClick  for more weather related news.",
        "author": "Neil Arwin Mercado"
    },
    {
        "source": "https://newsinfo.inquirer.net/1411535/egypt-shuts-suez-canal-amid-struggle-to-refloat-grounded-megaship",
        "date": "7:17 AM March 26, 2021",
        "title": "Egypt shuts Suez Canal amid struggle to refloat grounded megaship",
        "article_body": "\nCAIRO, Egypt  – The owners of a giant container vessel blocking the Suez Canal said Thursday they faced “extreme difficulty” refloating it, as Egypt temporarily closed one of the world’s busiest shipping lanes.\nEgyptian President Abdel Fattah al-Sisi’s advisor on seaports, Mohab Mamish, told AFP late Thursday that “maritime navigation will resume again within 48-72 hours, maximum”.\n“I have experience with several rescue operations of this kind and as the former chairman of the Suez Canal Authority, I know every centimetre of the canal,” said Mamish, who oversaw the recent expansion of the waterway.\nHowever, salvage experts had warned earlier on Thursday the shut-down could last days or even weeks, potentially forcing businesses to re-route cargo ships around the southern tip of Africa in a blow to global supply networks.\nOn the third day of the crisis, global shipping giant Maersk and Germany’s Hapag-Lloyd both said they were looking into going around Africa.\nThe Suez drastically shortens travel between Asia and Europe. The Singapore-Rotterdam route, for example, is 6,000 kilometres (3,700 miles) and up to two weeks shorter via the canal than going around Africa’s Cape of Good Hope.\nEgypt’s Suez Canal Authority (SCA) said it was doing all it could to refloat the MV Ever Given, a 400-metre (1,300-foot) long and 200,000 tonne vessel that veered off course and ran aground in a sandstorm on Tuesday.\nTug boats, dredgers and heavy earth-moving equipment have been deployed, but so far the ship has not budged.\n“It’s really a heavy whale on the beach, so to speak,” said Peter Berdowski, head of Dutch firm Smit Salvage, which previously worked on the stranded Italian cruise ship Costa Concordia and the sunken Russian nuclear submarine Kursk.\nThe salvage company was deploying a team to the site Thursday to assess what it would take to dislodge the Panama-flagged ship, said Berdowski, CEO of its parent company Boskalis.\n“I don’t want to speculate, but it can take days or weeks,” he told Dutch TV news programme Nieuwsuur on Wednesday.\nSatellite pictures released by Planet Labs Inc show the so-called “megaship”, which is longer than four football fields, wedged diagonally across the entire canal.\nWith ships waiting in both the Mediterranean and Red Sea and in the canal, the SCA announced it was “temporarily suspending navigation” along the waterway.\nJapanese ship-leasing firm Shoei Kisen Kaisha, the owner of the giant vessel, said it was facing “extreme difficulty” trying to refloat it.\n“We sincerely apologise for causing a great deal of worry to ships in the Suez Canal and those planning to go through the canal,” it said in a statement.\nA MarineTraffic map showed large clusters of vessels circling as they waited in both the Mediterranean to the north and the Red Sea to the south.\nOil prices had jumped by almost six percent on Wednesday in response to the Suez Canal accident, before dropping again on Thursday.\n“What a single vessel can do to the global oil market is remarkable,” said Rystad Energy analyst Bjornar Tonhaugen.\n“The stuck vessel in the Suez Canal created the visual definition of a supply route bottleneck, effectively disrupting one of the world’s busiest routes for all commodities.”\n“We’ve never seen anything like it before,” said Ranjith Raja, Middle East oil and shipping researcher at financial data firm Refinitiv.\n“It is likely that the congestion… will take several days or weeks to sort out as it will have a knock-on effect on other convoys.”\nThe vessel’s managers, Singapore-based Bernhard Schulte Shipmanagement, said the 25 crew aboard were unhurt and the hull and cargo undamaged.\n“The ultimate responsibility for the ship’s safety lies with the captain,” former SCA chairman Mamish noted.\nHistoric sections of the canal were reopened Wednesday in a bid to ease the congestion.\nThe Suez is an “absolutely critical” route, said Camille Egloff, a maritime transport specialist at Boston Consulting Group.\nNearly 19,000 ships passed through the canal last year carrying more than one billion tonnes of cargo, according to the SCA.\nEgypt earned $5.61 billion in revenues.\nCanal traffic has been disrupted several times in the past, notably during the Arab-Israeli wars of the second half of the 20th century.\nIt was closed for six months after Egypt nationalised the canal operating company in 1956, prompting an abortive invasion by Britain, France and Israel.\nMore recently, in 2018, the canal was temporarily closed after a Greek-owned bulk carrier suffered engine failure, triggering a five-ship collision.",
        "author": ""
    },
    {
        "source": "https://newsinfo.inquirer.net/1411532/new-york-city-deploying-asian-undercover-force-to-combat-hate-crimes",
        "date": "6:54 AM March 26, 2021",
        "title": "New York City deploying Asian undercover force to combat hate crimes",
        "article_body": "\nNEW YORK  – New York City plans to deploy an all-Asian undercover police team and expand community outreach in more than 200 languages to combat a rise in hate crimes against Asians, authorities said on Thursday.\n“If you are going to commit a hate crime in New York City, we will find you,” New York City Police Commissioner Dermot Shea said in unveiling the two-pronged plan to fight bias crimes.\n“We are not going to tolerate anyone being targeted because of the color of their skin, the religion they worship, their sexual preference or anything else,” Shea said.\nJust days after a spate of assaults on Asian-Americans in New York City last weekend, Shea said he was ramping up the NYPD’s undercover force with plain-clothed officers, all of them of Asian descent. Starting this weekend, they will patrol subways, grocery stores and other locations to stem anti-Asian incidents that total 26 so far this year, including 12 assaults, police said.\n“The next person you target through speech or menacing activity may be a plain-clothed New York police officer – so think twice,” Shea said.\nThe 26 incidents so far have resulted in seven arrests, police said. Those incidents included 12 assaults so far this year, three of them last weekend, police said. By comparison, at this time last year, there were no assaults reported against Asian-Americans, police said.\nBecause hate crimes too often go unreported, now anyone dialing 911 can utter a single English word for their native language – such as Mandarin – and police operators will help access translators who speak more than 200 languages, police said.\nAdvocates tied the surge in hate crimes to blame that has been placed on the Asian-American Pacific Islander community for the coronavirus spread. The community reported a spike in violence since March 2020, when then-President Donald Trump started repeatedly referring to COVID-19 as the “China virus” and “kung flu,” which some said inflamed anti-Asian sentiment.\nHate crimes against Asian Americans rose by 149% in 2020 in 16 major cities compared with 2019, according to the Center for the Study of Hate and Extremism. Violent incidents included people being slashed with a box cutter, lit on fire and verbal harassment, according to testimony at a U.S. congressional hearing on anti-Asian violence convened this month.\nThe most deadly incident was this month’s shooting spree at three Atlanta area spas that left eight people dead, six of them Asian women. A 21-year-old white man has been charged with multiple counts of murder, and police investigating motives have not ruled out the possibility that the attacks were provoked, at least in part, by anti-immigrant or anti-Asian sentiments.",
        "author": ""
    },
    {
        "source": "https://newsinfo.inquirer.net/1411529/still-a-mess-trauma-haunts-u-s-mass-shooting-survivors-due-to-gaps-in-mental-healthcare",
        "date": "6:41 AM March 26, 2021",
        "title": "Still a mess’: Trauma haunts U.S. mass shooting survivors due to gaps in mental healthcare",
        "article_body": "\nEven now, more than two decades after the Columbine school shooting, survivor Heather Martin is trying to learn how to take care of herself.\nShe struggled with her mental health for a decade before seeking professional help. There were dark days and years including intense trauma after the 9/11 attacks. Those struck more than two years after she barricaded herself in a Columbine classroom with 59 other students in 1999.\nMartin, 39, heard about the Sept. 11, 2001 attacks over the radio while driving to work. She has blacked out most of what happened next. She only remembers her coworkers at a restaurant asking why she was hiding behind an ice machine.\nSurvivors of mass shootings like Martin, family members of those who died in those attacks and psychologists agree that people who have experienced violence like the recent killings in Boulder and Atlanta need the care of mental health professionals, not just in the immediate aftermath but for years or decades afterward.\nThe United States lacks that effective and ongoing care. Survivors of mass shootings have stepped in themselves to fill gaps in a system that is a patchwork of local resources not designed to provide sustained response.\n“All the help in the world is there for the shooting victims right after the event,” Martin said. “But society quickly forgets and moves on. The victims and their families cannot forget, ever.”\nThirteen years after Columbine, a gunman opened fire in nearby Aurora, Colorado, killing 12 people in a movie theater.\nA few days after that shooting, Martin received a text from a fellow Columbine survivor, Jen Hammer, asking if she wanted to form a support group for shooting victims. She agreed immediately.\n“We wanted to offer something that we didn’t have access to in 1999 – peer support,” Martin said.\nIn forming their Rebels Project, Martin and several other Columbine survivors had to confront lingering demons.\n“We learned that 13 years later we were still struggling – there was a whole group of us who were still a mess,” she said.\nLike the Columbine survivors, Shiva Ghaed has found mental health support to be lacking.\nGhaed started thinking about the missing support shortly after she survived the 2017 Las Vegas shooting at a packed music festival that killed 60 people and injured nearly 900.\nA San Diego-based clinical psychologist who well before the shooting specialized in PTSD and trauma disorders, Ghaed escaped the Las Vegas shooting without physical injury.\nThe National Center for PTSD has estimated that 28% of people who have witnessed a mass shooting will suffer from post-traumatic stress disorder and about one-third acute stress disorder.\nVirtually all who do suffer PTSD can recover with the proper treatment, the course of which can vary widely depending upon the individual, Ghaed said.\n“After I came home following the Las Vegas shooting, I realized, ‘Oh, my God, I’m not hearing anything about any mental healthcare support for those who were there,'” she said.\nShe immediately formed a weekly support group. Amid the pandemic and other issues, that group has now disbanded. Ghaed continues to seek ways to provide support through her Route 91 Therapy website.\nSandy Phillips, whose daughter Jessica Ghawi was among those killed in the 2012 Aurora movie theater shooting, created the Survivors Empowered group.\nA day after Monday’s shootings in Boulder, Phillips’ group worked with three trauma therapy organizations to ensure that survivors and their families would not need to wait for government assistance or insurance approval to speak with a counselor.\n“We know that trauma therapy early on gives a huge difference in the ability to at least move forward in a healthy manner,” Phillips said.\nLaura Wilson, a clinical psychology professor at the University of Mary Washington in Virginia, whose research has focused in part on survivors of mass shootings, said she is concerned that the pandemic is overlooked as a complicating factor.\n“Community is a really powerful mechanism for recovery,” Wilson said. “The pandemic has complicated that because people can’t get together; they can’t safely hug someone outside of their household.”\nWilson said the mental health community agrees that the most efficient therapies are cognitive processing therapy, which seeks to change negative beliefs and behaviors, and prolonged exposure therapy, in which a patient gradually confronts the cause of anxiety.\nWilson’s research has shown that mass shootings – while representing just about 1% of gun deaths in the United States in any given year – have an outsized impact on the public at large.\nThose directly involved are most acutely affected, “but individuals across the country that don’t personally know anybody impacted can experience a psychological reaction,” Wilson said. “We see people posting on Twitter that their loved one was just going to buy milk, and the next thing they knew they were being shot at or killed, and that can impact anybody regardless of proximity to the event.”\nColorado state Representative Tom Sullivan only recently embraced therapy to cope with the loss of his son Alex, who was murdered at the Aurora movie theater in 2012 on his 27th birthday. Sullivan poured his energies into activism and politics, pushing for stricter gun laws.\nMichael Morisette also channeled grief into activism after his daughter Kristina was murdered in the Borderline Bar and Grill shooting in 2018, when a gunman killed 12 people in Thousand Oaks, California.\nMorisette choked on his sobs as he spoke about his daughter’s death at age 20 and his efforts to help other trauma victims. He left a retail sales job to become the California outreach coordinator for Give an Hour, an organization that provides no-cost mental health care.\nHe said family members of mass shooting victims “need peers who are walking alongside us, who have been through what we face.”\nConi Sanders, whose father Dave was a teacher and basketball coach at Columbine and the lone adult killed, said her grief motivated her to become a therapist who works with violent offenders in the Denver area. She hopes to prevent future tragedies.\nShe said that mental health efforts following mass shootings focus on the immediate weeks afterward.\n“But for many people that does not fit. I didn’t go to therapy until a few years after, which I found I couldn’t cope by myself anymore,” she said. “It’s a tricky journey, and support is needed at different times for years.”",
        "author": ""
    },
    {
        "source": "https://newsinfo.inquirer.net/1411526/biden-warns-of-responses-if-north-korea-escalates-but-open-to-diplomacy",
        "date": "6:32 AM March 26, 2021",
        "title": "Biden warns of responses if North Korea escalates, but open to diplomacy",
        "article_body": "\nWASHINGTON  – President Joe Biden said on Thursday the United States remained open to diplomacy with North Korea despite its missile tests this week, but warned there would be responses if North Korea escalates matters.\nBiden told his first White House news conference the suspected ballistic missile tests by Pyongyang violated U.N. resolution 1718, a 2006 measure through which the world body imposed sanctions on North Korea for missile and nuclear tests.\n“We are consulting with our allies and partners, and there will be responses if they choose to escalate. We will respond accordingly,” Biden said.\n“I’m also prepared for some form of diplomacy, but it has to be conditioned upon the end result of denuclearization,” he added, referring to the U.S. effort to persuade North Korea to give up its nuclear weapons.\nShortly after Biden’s remarks, the U.S. mission to the United Nations said the U.N. Security Council’s North Korea sanctions committee would meet on Friday, at the request of the United States, to discuss the North Korean launches.\nThe move suggested a measured response by Biden’s administration to the first tests since he took office in January, given that the meeting will be at a lower level than one held after North Korea last tested ballistic missiles a year ago.\nNorth Korea launched two suspected ballistic missiles into the sea near Japan on Thursday, underscoring steady progress in its weapons program and ramping up pressure on Biden’s administration even as it reviews its North Korea policy.\nThe tests came just days after North Korea fired several cruise missiles in an exercise that Biden had played down as “business as usual”.\nAsked if he agreed that North Korea was the top foreign policy issue he faced, Biden replied: “Yes.”\nThe Biden administration says it is in the final stages of a policy review after former President Donald Trump’s unprecedented engagement with North Korean leader Kim Jong Un, which failed to persuade Pyongyang to give up its nuclear weapons.\nThe current administration has been simultaneously signaling a hard line on human rights, denuclearization and sanctions, while making diplomatic overtures that administration officials say have been rebuffed by Pyongyang.\nAnalysts say the North Korean tests were likely a response to joint U.S. and South Korean military drills and Blinken’s recent visit to Japan and Korea, during which he criticized North Korea’s human rights record.\nVictor Cha, a former White House official now at the Center for Strategic and International Studies think tank, said the scale of the North Korean tests had been measured so far compared with those at the start of the Obama and Trump administrations.\nCha said they could be a tactic aimed at extracting concessions for a return to the negotiating table.\nJoel Wit, a fellow with 38 North, a Washington-based North Korea monitoring project, said some observers had predicted North Korean might return to testing intercontinental ballistic missiles, something is has not done since 2017.\n“This falls far short of that,” he said.\nJenny Town, the director of 38 North, said Biden’s reference to denuclearization could explain why North Korea had ignored his administration’s overtures.\nShe said his language ignored principles set out in a joint declaration agreed between Trump and Kim at their first summit in Singapore in 2018, “that gave equal priority to peace building, normalization of relations and working toward denuclearization.”\n“Bringing the focus of negotiations back to solely the nuclear issue is a step backward in diplomatic terms,” she said.\nBiden called Kim Jong Un a “thug” during his election campaign, and said he would only meet him “on the condition that he would agree that he would be drawing down his nuclear capacity to get there.”",
        "author": ""
    },
    {
        "source": "https://newsinfo.inquirer.net/1411523/u-s-and-britain-blacklist-myanmar-military-controlled-companies",
        "date": "6:22 AM March 26, 2021",
        "title": "U.S. and Britain blacklist Myanmar military-controlled companies",
        "article_body": "\nWASHINGTON  – The United States and Britain imposed sanctions on conglomerates controlled by Myanmar’s military on Thursday, following the generals’ Feb. 1 coup and deadly crackdown, with Washington calling it a response to “abhorrent violence and abuses.”\nThe U.S. Treasury department said its sanctions targeted Myanma Economic Holdings Public Company Ltd (MEHL) and Myanmar Economic Corporation Ltd (MEC).\nBritain imposed similar sanctions on MEHL, citing the Myanmar military’s serious human rights violations against Rohingya Muslims.\nRepresentatives for the two entities, which control big sections of the Myanmar economy, had no immediate comment on when Reuters reported on Wednesday the sanctions were expected.\nThursday’s actions were the most significant by far against the business interests of Myanmar’s military, which range from beer and cigarettes to telecommunications, tires, mining and real estate.\nShortly after the announcement, the State Department condemned the continued use of lethal force by authorities in Myanmar over the weekend that resulted in the deaths of at least 27 people, including several children.\n“These abhorrent and brutal acts against children, one as young as seven years old who was shot and killed in her home while sitting on her father’s lap, further demonstrate the horrific nature of the Burmese military regime’s assault on its own people,” department spokesman Ned Price said in a statement.\nWashington’s move freezes any assets held by the entities in the United States and is the latest in a series of sanctions following the military takeover that have targeted Myanmar’s central bank as well as top generals.\nThe designation prohibits American companies or citizens from trading or conducting financial transactions with those listed.\nSince almost all dollar payments clear through U.S. financial institutions, the move effectively kicks blacklisted companies out of the American banking system.\nU.S. Secretary of State Antony Blinken said the Myanmar military “have taken increasingly disturbing actions aimed at their own citizens since February 1.”\n“These actions will specifically target those who led the coup, the economic interests of the military, and the funding streams supporting the Burmese military’s brutal repression,” he said. “They are not directed at the people of Burma.\n“The United States and the UK have shown that we will follow through on our pledges to promote accountability for the coup and the abhorrent violence and other abuses we have seen in recent weeks,” Blinken said.\nAt a U.S. Senate hearing, Senator Ed Markey, Democratic chairman of the Asia subcommittee, said he welcomed the latest sanctions but called for more.\n“More must be done to deny the army its economic lifeline and to deny it the weapons of war. The United States should play a leading role in urging our partners and allies, including members of ASEAN, to take steps to cut off funding for the military,” he said, referring to the Association of Southeast Asian Nations.\nHuman rights groups welcomed the U.S. move but also urged more steps.\nHuman Rights Watch said the sanctions would create significant difficulties for the conglomerates in doing business with outside companies.\n“This is a very important step but it is not the biggest economic sanction that could be implemented,” said the group’s Asia advocacy director, John Sifton, adding that Washington should also target Myanmar’s revenues from natural gas joint ventures with international companies.\nGlobal Witness urged the European Union to also impose sanctions on the military’s business interests, and said Britain should follow the United States in targeting MEC.\nIn announcing the sanctions, the United States issued several licenses providing exemptions for official U.S. government transactions and those of international and nongovernmental organizations. One license authorized transactions necessary to wind down business involving MEC and MEHL or any entity they own, until June 22.",
        "author": ""
    }
]